{
  "inkVersion": 19,
  "root": [
    [{ "->": "dorm" }, ["done", { "#f": 5, "#n": "g-0" }], null],
    "done",
    {
      "dorm": [
        [
          { "#": "location: dorm" },
          "^You are standing in your dorm room. An old computer sits on your desk, connected to the school ethernet. Also on the desk is a paper you picked up from today's Extracurricular Fair. Next to your desk is a dresser filled with some of your clothes. On the other side of your room is your bed, and next to that is the door exiting to the hallway.",
          "\n",
          "ev",
          "str",
          "^Look at paper.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 20 },
          "ev",
          "str",
          "^Leave dorm.",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 4 },
          {
            "c-0": ["^ ", { "->": "paper" }, "\n", { "#f": 5 }],
            "c-1": ["^ ", { "->": "leave" }, "\n", { "#f": 5 }]
          }
        ],
        { "#f": 1 }
      ],
      "paper": [
        [
          "^You pick up the paper from your desk. It's a map of campus, with the dining hall circled. You passed by one of the desks at the Fair, and a guy standing nearby practically tripped over you to give you a copy. He said there's a radio station on the second floor of the diner.",
          "\n",
          "ev",
          "str",
          "^Place map in bag.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 4 },
          { "c-0": ["\n", { "->": "map" }, { "#f": 5 }] }
        ],
        { "#f": 1 }
      ],
      "map": [
        [
          { "#": "item: map" },
          "ev",
          "str",
          "^You place the map in your bag. You feel a little less lost.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 4 },
          { "c-0": ["^ ", { "->": "dorm" }, "\n", { "#f": 5 }] }
        ],
        { "#f": 1 }
      ],
      "leave": [
        [
          "^You walk towards the door. But where should you go?",
          "\n",
          "ev",
          "str",
          "^The diner.",
          "/str",
          { "CNT?": "map" },
          "/ev",
          { "*": ".^.c-0", "flg": 5 },
          "ev",
          "str",
          "^You're not sure yet...",
          "/str",
          "/ev",
          { "*": ".^.c-1", "flg": 4 },
          {
            "c-0": ["^ ", { "->": "diner" }, "\n", { "#f": 5 }],
            "c-1": ["^ ", { "->": "dorm" }, "\n", { "#f": 5 }]
          }
        ],
        { "#f": 1 }
      ],
      "diner": [
        [
          "^You walk across campus and reach the dining hall, entering through the back entrance. The stairwell before you feels strangely eerie with cinderblock walls painted a distateful yellow and scrawled with graffiti of students past and present. The stairs themselves are tied off with construction tape, so maybe it's best you take the elevator.",
          "\n",
          "ev",
          "str",
          "^Take the elevator up a floor.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 4 },
          { "c-0": ["^ ", { "->": "station" }, "\n", { "#f": 5 }] }
        ],
        { "#f": 1 }
      ],
      "station": [
        [
          "^You take the elevator up. It's cramped and feels unsteady, but perfectly functional. You step out and walk down a white hallway. Turning the corner, you see the entrance to the station. The call sign is painted above the doorway, in bold red letters. A little sloppy, but a little charming.",
          "\n",
          "^You walk into the lobby and see people milling about, talking animatedly to each other. The lobby is lined with old couches. One of the couches is upholstered in what looks like old denim jeans. A person with a denim jacket and blue jeans is sprawled on it, focused on something in her notebook. It's almost like she and the couch are one. She looks up when you walk in, and her face lights up. She waves you over.",
          "\n",
          "ev",
          "str",
          "^Talk to the Denim Couch Person.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 4 },
          { "c-0": ["^ ", { "->": "meet_julia" }, "\n", { "#f": 5 }] }
        ],
        { "#f": 1 }
      ],
      "meet_julia": [
        [
          { "#": "mood: grin" },
          { "#": "speaker: Julia" },
          { "#": "input: My name is..." },
          "^Hi, I'm Julia! Welcome to the radio station open house, you're just in time for the tour! What's your name?",
          "\n",
          "ev",
          "str",
          "^Submit.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 4 },
          { "c-0": ["^ ", { "->": "julia_greets" }, "\n", { "#f": 5 }] }
        ],
        { "#f": 1 }
      ],
      "julia_greets": [
        { "#": "mood: grin" },
        { "#": "speaker: Julia" },
        "^Hi, ",
        "ev",
        { "VAR?": "name" },
        "out",
        "/ev",
        "^! You're actually the second ",
        "ev",
        { "VAR?": "name" },
        "out",
        "/ev",
        "^ I met today. Although I don't know if that person was messing with me...",
        "\n",
        "^Anyway, let's start the tour! I'm not sure how much John told you during the fair, but this is the only freeform radio station in the entire metro area! It's all run by us students!",
        "\n",
        "^Freeform means we get to play whatever music we want... (I mean, within FCC guidelines, anyway...) But we're not beholden to any record labels, top 40 lists, no one on campus telling us what to say or do. As a DJ, you decide what music gets blasted on the airwaves.",
        "\n",
        "^Whenever I want to blast vaporwave, and mind you that's always, I can do that! My friend John has a show where he plays field recordings of trains for two hours? Is that even music? Who knows! We are the VOICE of the PEOPLE. and sometimes STEAM LOCOMOTIVES.",
        "\n",
        { "->": "fm_room" },
        { "#f": 1 }
      ],
      "fm_room": [
        "^Julia walks out of the lobby and into a narrow hallway. You follow her. She stops in front of a wooden door, all scratched and covered in band stickers. Through a small glass window, you can see a person sitting in front of a sound board and talking into a mic.",
        "\n",
        { "->": "julia_fm" },
        { "#f": 1 }
      ],
      "julia_fm": [
        { "#": "mood: grin" },
        { "#": "speaker: Julia" },
        "^here's the broadcasting booth. I'm not sure who's on right now actually... there's so many people involved in the station, sometimes I forget all the faces! but here we produce live shows that get broadcast on XX.X FM. we're a low-power station, so if you go to the very outskirts of CITY you might not be able to hear us. but you can tune in anywhere on campus!",
        "\n",
        { "->": "live_room" },
        { "#f": 1 }
      ],
      "live_room": [
        "^You and Julia walk to the next room. Here, the door is already propped open, and you see a wide space with various music equipment scattered about. The walls are covered in colorful signatures and illustrations.",
        "\n",
        { "->": "julia_live" },
        { "#f": 1 }
      ],
      "julia_live": [
        { "#": "mood: grin" },
        { "#": "speaker: Julia" },
        "^next door is the live room. this is the biggest area of the station, so we have our weekly General Body Meetings in here. we also host live concerts in here every saturday night! our live music director, Max, is in charge of those. she gets up-and-coming local and touring bands to perform here in the live room and broadcasts it on air.",
        "\n",
        { "->": "recording_studio" },
        { "#f": 1 }
      ],
      "recording_studio": [
        "^The live room has two interior doors, one serving as an additional entrance to the broadcasting booth. Julia ushers you into the other door, which leads to a smaller hallway, where a drum kit sits in the corner. She stands in front of a door with a numbered keypad.",
        "\n",
        { "->": "julia_studio" },
        { "#f": 1 }
      ],
      "julia_studio": [
        { "#": "mood: grin" },
        { "#": "speaker: Julia" },
        "^this is just the drumkit that we let live bands use. it's a pain to get gear up here, did you take the elevator up? super tiny. and over here is the recording studio. also looks like it's being used right now so let's not go in. some of our most expensive equipment is in here, so it has to stay locked up. people can come here and record their own music, or record any public service announcements that we want to run on air. kay is in charge of the recording studio, so go to her if you ever need to use the space.",
        "\n",
        { "->": "record_library" },
        { "#f": 1 }
      ],
      "record_library": [
        "^Julia walks further down the hallway and sweeps her hands triumphantly across another door.",
        "\n",
        { "->": "julia_library" },
        { "#f": 1 }
      ],
      "julia_library": [
        [
          { "#": "mood: grin" },
          { "#": "speaker: Julia" },
          "^oh, this is my favorite place in the whole station! the record library!",
          "\n",
          "ev",
          "str",
          "^Okay.",
          "/str",
          "/ev",
          { "*": ".^.c-0", "flg": 4 },
          { "c-0": ["^ ", "end", "\n", { "#f": 5 }] }
        ],
        { "#f": 1 }
      ],
      "global decl": [
        "ev",
        "str",
        "^???",
        "/str",
        { "VAR=": "name" },
        "/ev",
        "end",
        null
      ],
      "#f": 1
    }
  ],
  "listDefs": {}
}
